# Description Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..Description Property
AnalysisResultSchema Class See Also
---
Description of analysis result in view
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Description { get; set; }
```

Visual Basic
---
```text
Public Property Description As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace